# Loc vs ILoc

In [18]:
import pandas as pd

In [2]:
arr = [
       [150,'Bukit Duri',100,220,'Darurat'],
       [90,'Katulampa',220,180,'Darurat'],
       [100,'Bukit Duri',200,150,'Siaga'],
       [200,'Beji',200,130,'Siaga'],
       [150,'Beji',100,180,'Darurat'],
       [190,'Katulampa',210,150,'Darurat'],
]

In [3]:
df = pd.DataFrame(arr)
df.columns = ['curah_hujan','site','debit_air','tinggi_muka_air','status']
df

   curah_hujan        site  debit_air  tinggi_muka_air   status
0          150  Bukit Duri        100              220  Darurat
1           90   Katulampa        220              180  Darurat
2          100  Bukit Duri        200              150    Siaga
3          200        Beji        200              130    Siaga
4          150        Beji        100              180  Darurat
5          190   Katulampa        210              150  Darurat

## Loc
- df.loc[row, col]
- row : if we use index 1:3 it will be display 1,2,3 index
- col : using column_key

In [21]:
df.loc[1:4,'site':'tinggi_muka_air']

         site  debit_air  tinggi_muka_air
1   Katulampa        220              180
2  Bukit Duri        200              150
3        Beji        200              130
4        Beji        100              180

## Iloc
- df.iloc[row, col]
- row : if we use index 1:3 it will be display 1,2 index
- col: using index too

In [19]:
df.iloc[1:4,1:4]

         site  debit_air  tinggi_muka_air
1   Katulampa        220              180
2  Bukit Duri        200              150
3        Beji        200              130